Repository: gtoffoli/commons-textanalysis
Catalog: textanalysis/locale/*/LC_MESSAGES/django.po
Languages: it

source: Dependency parse
it: Analisi di dipendenza

source: Keywords In Context
it: Parole nel contesto (KIC)

source: Word Lists by POS
it: Elenchi di parole per categoria lessicale (POS)

source: Annotated text
it: Testo annotato

source: Entities and terms
it: Entità e termini

source: Text Readability
it: Leggibilità del testo

source: Text Cohesion
it: Coesione del testo

source: Text Summarization
it: Riassunto del testo

source: text to analyze
it: testo da analizzare

source: short text of a few paragraphs, or url of a web page
it: breve testo o URL di pagina web

source: text-analysis function
it: funzione di analisi del testo

source: select one
it: scegli uno/una

source: glossary
it: glossario

source: auto-complete search; the selected glossary, if any, is used only by a few functions
it: ricerca a completamento automatico; il glossario eventualmente selezionato è usato solo da alcune funzioni

source: the Text Analysis project
it: il progetto Text Analysis

source: interactive text analyzer
it: analizzatore di testo interattivo

source: text analysis functions
it: funzioni di analisi del testo

source: working with corpora
it: operare con i corpora

source: show project
it: mostra il progetto

source: and its sub-projects
it: e i suoi sottoprogetti

source: expand / collapse
it: espandi / comprimi

source: selected resources
it: risorse selezionate

source: by
it: per

source: state
it: stato

source: narrower access
it: accesso più ristretto

source: wider access
it: accesso più largo

source: empty corpus
it: corpus vuoto

source: new corpus
it: nuovo corpus

source: delete corpus
it: elimina il corpus

source: add item from local file to corpus
it: aggiungi al corpus un elemento da file locale

source: upload a file from local device to corpus
it: carica un file dal dispositivo locale

source: pick a file
it: seleziona un file

source: drop a file
it: rilascia un file

source: add item from web resource to corpus
it: aggiungi al corpus un elemento da risorsa web

source: insert the URL of a web resource, then click on
it: inserisci l'URL di una risorsa web e poi clicca su

source: add item from text box to corpus
it: aggiungi al corpus un item da un area di testo

source: insert a text, then click on
it: inserisci un testo e poi clicca su

source: add references to terms and synsets
it: aggiungi riferimenti a termini e synset

source: remove item
it: elimina questo elemento

source: show / hide corpus menu
it: mostra /nascondi il menu del corpus

source: show / hide item menu
it: mostra /nascondi il menu dell'elemento

source: manage associated glossaries
it: gestisci i glossari associati

source: manage associated BabelNet domains
it: gestisci i domini BabelNet associati

source: similarity
it: somiglianza

source: Entities and Terms
it: Entità e Termini

source: confirm deletion
it: conferma l'eliminazione

source: confirm change
it: conferma la modifica

source: enter text for new item of corpus
it: inserisci il testo per il nuovo elemento del corpus

source: enter item title in this line
it: inserisci il titolo dell'elemento in questa linea

source: enter text starting on second line
it: inserisci il testo a partire dalla seconda linea

source: enter url here
it: inserisci qui l'URL

source: Text Analysis
it: Analisi del Testo

source: title
it: titolo

source: language
it: lingua

source: please wait
it: sei pregato di attendere

source: Text cohesion
it: Coesione del testo

source: Content Analysys
it: Analisi del Contenuto

source: corpus identifier
it: identificatore del corpus

source: corpus contents
it: contenuti del corpus

source: comparison of lexical lemmas among documents
it: confronto di lemmi lessicali tra documenti

source: enter input for text analyzer
it: inserisci l'input per l'analizzatore di testo

source: enter input for Text Analyzer
it: inserisci l'input per l'Analizzatore di Testo

source: language app version
it: versione della app linguistica

source: spaCy version
it: versione di spaCy

source: execute
it: esegui

source: TBX Glossary
it: Glossario TBX

source: see
it: vedi

source: languages
it: lingue

source: terminology source
it: origine della terminologia

source: source collections
it: collezioni di origine

source: subjects
it: soggetti

source: select languages to display by toggling the buttons above; grey background means 'non-selected'
it: seleziona le lingue da visualizzare cliccando sui pulsanti qui sopra; uno sfondo grigio significa "non selezionata"

source: filter terms by included substring: enter 3 chars at least
it: filtra i termini in base ad una sottostringa: inserisci almeno 3 caratteri

source: select columns to hide
it: seleziona le colonne da nascondere

source: enter search string here
it: digita qui la stringa di ricerca

source: export as TBX
it: esporta come TBX

source: export as CSV
it: esporta come CSV

source: only visible content will be exported
it: sarà esportato solo il contenuto visibile

source: concept
it: concetto

source: concepts and terms
it: concetti e termini

source: filters setting
it: impostazione dei filtri

source: definition
it: definizione

source: def.source
it: origine def.

source: lang
it: lingua

source: type
it: tipo

source: rel.
it: fid.

source: term
it: termine

source: Text annotations
it: Annotazioni del testo

source: text annotated and colored by POS
it: testo annotato e colorato in base alla POS

source: select parts of speech (POS) to highlight by toggling the buttons above; grey background means 'non-selected'
it: seleziona le categorie lessicali (POS) da evidenziare, agendo sui pulsanti qui sopra; uno sfondo grigio significa "non selezionata"

source: tokens colored by POS
it: token colorati in base alla POS

source: paragraph
it: paragrafo

source: with reference to max 3 previous paragraphs
it: con riferimento ai 3 paragrafi precedenti

source: similarity is computed by spaCy using feature vectors
it: la somiglianza è calcolata da spaCy per mezzo di vettori di caratteristiche

source: text cohesion computed with different methods
it: coesione del testo calcolata con diversi metodi

source: method
it: metodo

source: normalized score
it: punteggio normalizzato

source: lexicon shared by contiguous paragraphs (see detail below)
it: lessico condiviso da paragrafi contigui (vedi i dettagli più sotto)

source: weighted entity graph at sentence level (from TRUNAJOD)
it: grafo pesato di entità a livello di frase (da TRUNAJOD)

source: similarity of contiguous paragraphs (from spaCy models)
it: somiglianza di paragrafi contigui (dai modelli di spaCy)

source: values are indicative and useful only for comparison
it: i valori sono indicativi e utili solo a fini comparativi

source: local lexical cohesion
it: coesione lessicale locale

source: most cohesive nominal lemmas
it: lemmi nominali più coesivi

source: text cohesion based on shared lexicon
it: coesione del testo basata sul lessico condiviso

source: named entities, noun chunks, glossary terms and BabelNet synsets
it: entità nominate, nuclei di frasi nominali, termini del glossario e synset di BabelNet

source: span types to highlight
it: tipi di spezzone di frase da evidenziare

source: select types of span by toggling the buttons above; thick border means 'selected'
it: seleziona le lingue da visualizzare usando i pulsanti qui sopra; uno sfondo grigio significa "non selezionata"

source: noun chunks are noun phrases without subordinates
it: i nuclei nominali sono frasi nominali semplici, senza subordinate

source: synsets are ako concepts with associated multilanguage lexicon
it: un synset è una sorta di concetto con un lessico multilingua associato

source: text features
it: caratteristiche del testo

source: raw text features
it: caratteristiche grezze del testo

source: sentences
it: frasi

source: tokens
it: token

source: mean / max. tokens per sentence
it: numero di token medio / max per frase

source: characters
it: caratteri

source: mean characters per token
it: lunghezza media dei token in caratteri

source: syllables
it: sillabe

source: mean syllables per token
it: lunghezza media dei token in sillabe

source: lexical features
it: caratteristiche lessicali

source: word types (unique word forms)
it: forme uniche (di parola)

source: type-token ratio
it: rapporto forme uniche / token

source: lexical-total tokens ratio
it: rapporto token lessicali / totali

source: lexical rarity
it: rarità lessicale

source: from basic vocabulary or frequency lists
it: da vocabolario di base o lessico di frequenza

source: syntactic features
it: caratteristiche sintattiche delle frasi

source: mean / max. largest dependency depth
it: valore medio / max della max profondità di dipendenza

source: mean / max. largest dependency distance
it: valore medio / max della max distanza di dipendenza

source: mean / max. largest weighted dependency distance
it: valore medio / max della max distanza di dipendenza pesata

source: stylistic features
it: caratteristiche stilistiche

source: adverbs-adjectives ratio
it: rapporto avverbi / aggettivi

source: adjectives-pronouns ratio
it: rapporto aggettivi / pronomi

source: readability formulas
it: formule di leggibilità

source: value
it: valore

source: range
it: gamma dei valori

source: reference
it: riferimento

source: no readability formulas are available yet for
it: non sono ancora disponibili formule di leggibilità per

source: Summarization
it: Riassunto

source: summary
it: riassunto

source: the result of a very simple extractive algorithm
it: risultato di un algoritmo estrattivo molto semplice

source: original input
it: input originale

source: bad response status
it: stato di risposta negativo

source: invalid document url
it: URL di documento non valido

source: unicode decode error
it: errore di decodifica unicode

source: Private draft
it: Bozza privata

source: Published internally
it: Pubblicato all'interno

source: Submitted for publication
it: Sottoposto per la pubblicazione

source: Published for all
it: Pubblicato per tutti

source: Un-published
it: Ritirato

source: commonspaces project
it: progetto commonspaces

source: document file
it: file di documento

source: google document
it: documento google

source: open educational resource
it: risorsa educativa aperta

source: node of learning path
it: nodo di percorso di apprendimento

source: learning path
it: percorso di apprendimento

source: remote web resource
it: risorsa web remota

source: manually input text
it: testo inserito manualmente

source: uploaded file
it: file caricato

source: text corpus
it: corpus testuale

source: noun chunks
it: nuclei di frasi nominali

source: glossary terms
it: termini di glossario

source: babenet synsets
it: synset di babelnet

source: sorry, it looks like the language processing service is off
it: purtroppo sembra che il servizio di elaborazione del linguaggio non sia attivo
